blog/2016-08-26-虚拟化与kvm.org
#+TITLE: 虚拟化与KVM
#+DATE: 2016-08-06
#+SETUPFILE: ~/myblog/setupfile.org
#+JEKYLL_LAYOUT: post
#+JEKYLL_CATEGORIES: 虚拟化
#+JEKYLL_TAGS: Linux 虚拟化
#+JEKYLL_PUBLISHED: true

* 虚拟化
** CPU虚拟化
: CPU的分级保护域ring
:   ring -1: 特权指令，需要硬件的支持
:   ring 0: 虚拟机(Guest)根区域，能被主机(hypervisor)捕获
:   ring 1/2: 未使用
:   ring 3: 用户指令
- 模拟(emulation) :: 纯软件实现，需要模拟CPU的所有ring(0/1/2/3)，可模拟出不同的硬件架构
- 虚拟(virtualization) :: 只能使用相同的硬件架构
  - =完全虚拟化(full-virtualization)=: Guest不知道自己运行在虚拟化中
      - =BT(vmware)=: 二进制翻译软件，需要模拟CPU的ring 0，Guest的内核运行在ring 1上
      - =HVM=: 硬件辅助的虚拟化，主机使用ring -1，Guest使用ring 0
  - =半虚拟化(para-virtualization)=: Guest知道自己运行在虚拟化中，直接调用 =hypervisor= 的 =hyper call=
** Memory虚拟化
- 虚拟地址空间 ::
  - =进程=: 线性地址空间
  - =内核=: 物理地址空间
- MMU Virtualization :: 虚拟机的进程只需要经过一次转换即可
  - Intel: =EPT= (Extended Page Table)
  - AMD: =NTP= (Nested Page Table)
- TLB virtualization :: 解决虚拟机切换所导致的TLB(Table buffer)无效
  - =tagged TLB=
** I/O设备虚拟化
- I/O设备类型 ::
  - 外存: 硬盘、光盘、U盘
  - 网络设备: 网卡
  - 显示设备: VGA(利用 =frame buffer= 机制虚拟)
  - 键盘鼠标: ps/2, usb
- I/O虚拟化的方式 ::
  - =模拟=: 完全使用软件来模拟真实硬件
  - =半虚拟化化=: 同CPU虚拟化
  - =IO-through=: 主机有多块I/O设备
    - =Intel=: VT-d，隔离DMA的中断请求，完成物理DMA到虚拟DMA的映射
** 虚拟化的实现方式
- Type-I :: 直接在硬件上运行一个Hypervisor来管理虚拟机
  - =xen=, =vmware ESX/ESXi=
- Type-II :: 需要在主机系统基础上，借助虚拟化软件vmm管理虚拟机
  - =kvm=, =vmware workstation=, =virtualbox=
** 虚拟技术分类
- 模拟 :: 使用软件模拟硬件环境
  - PearPC, Bochs, QEMU
- 完全虚拟化 ::
  - VMware Workstation, VMware Server, Parallels Desktop, KVM, Xen(HVM)
- 半虚拟化 :: 内核需要支持hyper call
  - xen, uml(user-mode linux)
- OS级别的虚拟化 :: 虚拟用户空间
  - OpenVZ, lxc
  - Solaris Containers
  - FreeBSD jails
- 库虚拟化 :: 
  - wine
- 应用程序虚拟化 :: 
  - jvm
** 虚拟化网络
- =bridge mode=: 主机网卡当作交换机使用，虚拟网卡有自己的mac
- =host only=: 在主机上虚拟交换机和另一张虚拟网卡，连接虚拟机的虚拟网卡
- =routed mode=: 在host only的基础上，打开电脑的ip地址转发
- =nat mode=: 在host only的基础上，将主机配置为nat服务器
- =isolation mode=: 在主机上虚拟交换机，仅连接虚拟机的虚拟网卡
** linux的虚拟网络设备
- =tap= 设备是一种工作在二层协议的点对点网络设备，每一个tap设备都有一个对应的linux字符设备，用户程序可以通过对字符设备的读写操作，完成与linux内核网络协议栈的数据交换工作，在虚拟化环境中经常被模拟器使用
- =tun= 模拟了网络层设备，操作第三层数据包比如ip数据封包
** 实现虚拟化网络(sdn)
*** 添加桥设备
桥设备是基于内核实现的二层数据交换设备
#+begin_src bash
brctl addbr br0
brctl stp br0 off  # 关闭stp

ip link set dev br0 up  # 启用该桥设备
#+END_SRC
- 若要将主机连接至桥设备，只需要对桥接口设置IP地址即可
  #+BEGIN_SRC bash
  ip addr add IP/MASK dev br0  # 设定在桥设备上的地址
  #+END_SRC
*** 添加veth设备
VETH设备是一种成对出现的点对点网络设备，从一段输入的数据会从另一端改变方向输出，通常用于改变数据方向，或连接其它网络设备
#+BEGIN_SRC yaml
ip addr add veth0 type veth peer name veth1
#+END_SRC
*** 配置桥接模式
: 配置桥接网络不能开启NetworkManager
- 不使用工具来配置桥接网络 ::
  1. 克隆原来的网卡设备脚本为桥设备脚本 =ifcfg-br0=
    #+BEGIN_SRC yaml
    DEVICE=br0
    NM_CONTROLLED=no
    TYPE=Bridge
    ...
    #+END_SRC
  2. 将原来的网卡设备脚本作为交换机关联到br0上
    #+BEGIN_SRC yaml
    DEVICE=eth0
    BOOTPROTO=none
    NM_CONTROLLED=none
    TYPE=Ethernet
    BRIDGE=br0
    IPV6INIT=no
    #+END_SRC
- 使用 =bridge-utils= 来配置 ::
  #+BEGIN_SRC yaml
  brctl show  # 显示所有桥设备
  brctl addbr br0  # 添加一个桥设备

  ip addr del IP dev eth0  # 删除eth0的地址

  brctl addif br0 eth0  # 连接桥设备和被作为交换机的网卡
  ip link set eth0 promisc on  # 开启网卡的混杂模式，以接受所有发来的包

  ip addr add IP/MASK dev br0  # 将eth0原来的地址配置到桥设备上
  route add default gw GW
  #+END_SRC
: 可以使用 nmgui 对网络进行管理
* KVM
#+BEGIN_EXAMPLE
KVM: Kernel-based Virtual Machine，依赖于HVM (VT-x, ADM-V)
#+END_EXAMPLE
** 系统的运行模式
- =来宾-内核模式=: GuestOS的内核模式，用于执行I/O类操作，或其它的特殊指令的操作，之后交给VMM负责管理运行
- =来宾-用户模式=: GuestOS的内核模式，用于执行非I/O类操作，若架构一样直接在CPU上运行，否则需要交给VMM负责运行
- =用户模式=: 宿主机的用户空间，代表GuestOS请求I/O类操作
- =kvm hypervisor=: 宿主机自己的内核空间
** KVM组件
- =/dev/kvm=: 工作于 =hypervisor= 的字符设备，在用户空间可通过 =ioctl()= 系统调用来完成VM的管理功能，如创建VM、为VM分配内存、读写VCPU的寄存器、向VCPU注入中断、运行VCPU等等
- =QEMU进程=: 工作于用户空间，主要用于实现模拟PC机的I/O设备，其功能如下
  - 处理器模拟器(不同架构)
  - 仿真I/O设备
  - 关联模拟的设备至真实设备
  - 调试器
  - 与模拟器交互的用户接口

** KVM特性
- 内存管理
  - 将分配给VM的内存交换至SWAP
  - 支持使用Huge Page
  - 支持使用Intel EPT或AMD RVI技术完成内存地址映射
  - 支持KSM(Kernel Same-page Merging): 合并相同的共享库文件内存
- 存储
  - 本地存储
  - 网络附加存储
  - 存储区域网络
  - 分布式存储，如GlustFS
- 实时迁移: 在使用共享存储的基础上，通过内存复制的方法迁移正在运行的虚拟机
- 支持运行Linux, Windows, OpenBSD, FreeBSD, OpenSolaris
- 设备驱动
  - I/O设备的完全虚拟化: 模拟硬件
  - I/O设备的半虚拟化: 在GuestOS中安装驱动(virtio)
