_posts/2016-08-26-虚拟化与kvm.html
---
title: "虚拟化与KVM"
date: 2016-08-06
layout: post
categories: 
- 虚拟化
tags: 
- Linux 
- 虚拟化
published: true
comments: 
---
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#orgheadline12">1. 虚拟化</a>
<ul>
<li><a href="#orgheadline1">CPU虚拟化</a></li>
<li><a href="#orgheadline2">Memory虚拟化</a></li>
<li><a href="#orgheadline3">I/O设备虚拟化</a></li>
<li><a href="#orgheadline4">虚拟化的实现方式</a></li>
<li><a href="#orgheadline5">虚拟技术分类</a></li>
<li><a href="#orgheadline6">虚拟化网络</a></li>
<li><a href="#orgheadline7">linux的虚拟网络设备</a></li>
<li><a href="#orgheadline11">实现虚拟化网络(sdn)</a>
<ul>
<li><a href="#orgheadline8">添加桥设备</a></li>
<li><a href="#orgheadline9">添加veth设备</a></li>
<li><a href="#orgheadline10">配置桥接模式</a></li>
</ul>
</li>
</ul>
</li>
<li><a href="#orgheadline32">2. KVM</a>
<ul>
<li><a href="#orgheadline13">系统的运行模式</a></li>
<li><a href="#orgheadline14">KVM组件</a></li>
<li><a href="#orgheadline15">KVM特性</a></li>
<li><a href="#orgheadline16">KVM局限性</a></li>
<li><a href="#orgheadline17">KVM工具</a></li>
<li><a href="#orgheadline18">KVM的安装</a></li>
<li><a href="#orgheadline19">半虚拟化virtio</a></li>
<li><a href="#orgheadline30">QEMU</a>
<ul>
<li><a href="#orgheadline28">qemu-kvm</a></li>
<li><a href="#orgheadline29">qemu-img</a></li>
</ul>
</li>
<li><a href="#orgheadline31">虚拟机迁移</a></li>
</ul>
</li>
<li><a href="#orgheadline46">3. libvirt工具</a>
<ul>
<li><a href="#orgheadline33">libvirt</a></li>
<li><a href="#orgheadline34">libvirt的安装和配置</a></li>
<li><a href="#orgheadline35">使用桥接模式</a></li>
<li><a href="#orgheadline44">virt-install</a>
<ul>
<li><a href="#orgheadline36">一般选项</a></li>
<li><a href="#orgheadline37">安装方法</a></li>
<li><a href="#orgheadline38">存储配置</a></li>
<li><a href="#orgheadline39">网络配置</a></li>
<li><a href="#orgheadline40">设备选项</a></li>
<li><a href="#orgheadline41">虚拟化选项</a></li>
<li><a href="#orgheadline42">其它选项</a></li>
<li><a href="#orgheadline43">virt-install使用示例</a></li>
</ul>
</li>
<li><a href="#orgheadline45">virsh常用命令</a></li>
</ul>
</li>
</ul>
</div>
</div>

<div id="outline-container-orgheadline12" class="outline-2">
<h2 id="orgheadline12"><span class="section-number-2">1</span> 虚拟化</h2>
<div class="outline-text-2" id="text-1">
</div><div id="outline-container-orgheadline1" class="outline-3">
<h3 id="orgheadline1">CPU虚拟化</h3>
<div class="outline-text-3" id="text-orgheadline1">
<pre class="example">
CPU的分级保护域ring
  ring -1: 特权指令，需要硬件的支持
  ring 0: 虚拟机(Guest)根区域，能被主机(hypervisor)捕获
  ring 1/2: 未使用
  ring 3: 用户指令
</pre>
<dl class="org-dl">
<dt>模拟(emulation)</dt><dd>纯软件实现，需要模拟CPU的所有ring(0/1/2/3)，可模拟出不同的硬件架构</dd>
<dt>虚拟(virtualization)</dt><dd>只能使用相同的硬件架构
<ul class="org-ul">
<li><code>完全虚拟化(full-virtualization)</code>: Guest不知道自己运行在虚拟化中
<ul class="org-ul">
<li><code>BT(vmware)</code>: 二进制翻译软件，需要模拟CPU的ring 0，Guest的内核运行在ring 1上</li>
<li><code>HVM</code>: 硬件辅助的虚拟化，主机使用ring -1，Guest使用ring 0</li>
</ul></li>
<li><code>半虚拟化(para-virtualization)</code>: Guest知道自己运行在虚拟化中，直接调用 <code>hypervisor</code> 的 <code>hyper call</code></li>
</ul></dd>
</dl>
</div>
</div>
<div id="outline-container-orgheadline2" class="outline-3">
<h3 id="orgheadline2">Memory虚拟化</h3>
<div class="outline-text-3" id="text-orgheadline2">
<dl class="org-dl">
<dt>虚拟地址空间</dt><dd><ul class="org-ul">
<li><code>进程</code>: 线性地址空间</li>
<li><code>内核</code>: 物理地址空间</li>
</ul></dd>
<dt>MMU Virtualization</dt><dd>虚拟机的进程只需要经过一次转换即可
<ul class="org-ul">
<li>Intel: <code>EPT</code> (Extended Page Table)</li>
<li>AMD: <code>NTP</code> (Nested Page Table)</li>
</ul></dd>
<dt>TLB virtualization</dt><dd>解决虚拟机切换所导致的TLB(Table buffer)无效
<ul class="org-ul">
<li><code>tagged TLB</code></li>
</ul></dd>
</dl>
</div>
</div>
<div id="outline-container-orgheadline3" class="outline-3">
<h3 id="orgheadline3">I/O设备虚拟化</h3>
<div class="outline-text-3" id="text-orgheadline3">
<dl class="org-dl">
<dt>I/O设备类型</dt><dd><ul class="org-ul">
<li>外存: 硬盘、光盘、U盘</li>
<li>网络设备: 网卡</li>
<li>显示设备: VGA(利用 <code>frame buffer</code> 机制虚拟)</li>
<li>键盘鼠标: ps/2, usb</li>
</ul></dd>
<dt>I/O虚拟化的方式</dt><dd><ul class="org-ul">
<li><code>模拟</code>: 完全使用软件来模拟真实硬件</li>
<li><code>半虚拟化化</code>: 同CPU虚拟化</li>
<li><code>IO-through</code>: 主机有多块I/O设备
<ul class="org-ul">
<li><code>Intel</code>: VT-d，隔离DMA的中断请求，完成物理DMA到虚拟DMA的映射</li>
</ul></li>
</ul></dd>
</dl>
</div>
</div>
<div id="outline-container-orgheadline4" class="outline-3">
<h3 id="orgheadline4">虚拟化的实现方式</h3>
<div class="outline-text-3" id="text-orgheadline4">
<dl class="org-dl">
<dt>Type-I</dt><dd>直接在硬件上运行一个Hypervisor来管理虚拟机
<ul class="org-ul">
<li><code>xen</code>, <code>vmware ESX/ESXi</code></li>
</ul></dd>
<dt>Type-II</dt><dd>需要在主机系统基础上，借助虚拟化软件vmm管理虚拟机
<ul class="org-ul">
<li><code>kvm</code>, <code>vmware workstation</code>, <code>virtualbox</code></li>
</ul></dd>
</dl>
</div>
</div>
<div id="outline-container-orgheadline5" class="outline-3">
<h3 id="orgheadline5">虚拟技术分类</h3>
<div class="outline-text-3" id="text-orgheadline5">
<dl class="org-dl">
<dt>模拟</dt><dd>使用软件模拟硬件环境
<ul class="org-ul">
<li>PearPC, Bochs, QEMU</li>
</ul></dd>
<dt>完全虚拟化</dt><dd><ul class="org-ul">
<li>VMware Workstation, VMware Server, Parallels Desktop, KVM, Xen(HVM)</li>
</ul></dd>
<dt>半虚拟化</dt><dd>内核需要支持hyper call
<ul class="org-ul">
<li>xen, uml(user-mode linux)</li>
</ul></dd>
<dt>OS级别的虚拟化</dt><dd>虚拟用户空间
<ul class="org-ul">
<li>OpenVZ, lxc</li>
<li>Solaris Containers</li>
<li>FreeBSD jails</li>
</ul></dd>
<dt>库虚拟化</dt><dd><ul class="org-ul">
<li>wine</li>
</ul></dd>
<dt>应用程序虚拟化</dt><dd><ul class="org-ul">
<li>jvm</li>
</ul></dd>
</dl>
</div>
</div>
<div id="outline-container-orgheadline6" class="outline-3">
<h3 id="orgheadline6">虚拟化网络</h3>
<div class="outline-text-3" id="text-orgheadline6">
<ul class="org-ul">
<li><code>bridge mode</code>: 主机网卡当作交换机使用，虚拟网卡有自己的mac</li>
<li><code>host only</code>: 在主机上虚拟交换机和另一张虚拟网卡，连接虚拟机的虚拟网卡</li>
<li><code>routed mode</code>: 在host only的基础上，打开电脑的ip地址转发</li>
<li><code>nat mode</code>: 在host only的基础上，将主机配置为nat服务器</li>
<li><code>isolation mode</code>: 在主机上虚拟交换机，仅连接虚拟机的虚拟网卡</li>
</ul>
</div>
</div>
<div id="outline-container-orgheadline7" class="outline-3">
<h3 id="orgheadline7">linux的虚拟网络设备</h3>
<div class="outline-text-3" id="text-orgheadline7">
<ul class="org-ul">
<li><code>tap</code> 设备是一种工作在二层协议的点对点网络设备，每一个tap设备都有一个对应的linux字符设备，用户程序可以通过对字符设备的读写操作，完成与linux内核网络协议栈的数据交换工作，在虚拟化环境中经常被模拟器使用</li>
<li><code>tun</code> 模拟了网络层设备，操作第三层数据包比如ip数据封包</li>
</ul>
</div>
</div>
<div id="outline-container-orgheadline11" class="outline-3">
<h3 id="orgheadline11">实现虚拟化网络(sdn)</h3>
<div class="outline-text-3" id="text-orgheadline11">
</div><div id="outline-container-orgheadline8" class="outline-4">
<h4 id="orgheadline8">添加桥设备</h4>
<div class="outline-text-4" id="text-orgheadline8">
<p>
桥设备是基于内核实现的二层数据交换设备
</p>
<div class="org-src-container">

<pre class="src src-bash">brctl addbr br0
brctl stp br0 off  <span style="color: #75715E;"># </span><span style="color: #75715E;">&#20851;&#38381;stp</span>

ip link set dev br0 up  <span style="color: #75715E;"># </span><span style="color: #75715E;">&#21551;&#29992;&#35813;&#26725;&#35774;&#22791;</span>
</pre>
</div>
<ul class="org-ul">
<li><p>
若要将主机连接至桥设备，只需要对桥接口设置IP地址即可
</p>
<div class="org-src-container">

<pre class="src src-bash">ip addr add IP/MASK dev br0  <span style="color: #75715E;"># </span><span style="color: #75715E;">&#35774;&#23450;&#22312;&#26725;&#35774;&#22791;&#19978;&#30340;&#22320;&#22336;</span>
</pre>
</div></li>
</ul>
</div>
</div>
<div id="outline-container-orgheadline9" class="outline-4">
<h4 id="orgheadline9">添加veth设备</h4>
<div class="outline-text-4" id="text-orgheadline9">
<p>
VETH设备是一种成对出现的点对点网络设备，从一段输入的数据会从另一端改变方向输出，通常用于改变数据方向，或连接其它网络设备
</p>
<div class="org-src-container">

<pre class="src src-yaml">ip addr add veth0 type veth peer name veth1
</pre>
</div>
</div>
</div>
<div id="outline-container-orgheadline10" class="outline-4">
<h4 id="orgheadline10">配置桥接模式</h4>
<div class="outline-text-4" id="text-orgheadline10">
<pre class="example">
配置桥接网络不能开启NetworkManager
</pre>
<dl class="org-dl">
<dt>不使用工具来配置桥接网络</dt><dd><ol class="org-ol">
<li><p>
克隆原来的网卡设备脚本为桥设备脚本 <code>ifcfg-br0</code>
</p>
<div class="org-src-container">

<pre class="src src-yaml">DEVICE=br0
NM_CONTROLLED=no
TYPE=Bridge
<span style="color: #75715E;">...</span>
</pre>
</div></li>
<li><p>
将原来的网卡设备脚本作为交换机关联到br0上
</p>
<div class="org-src-container">

<pre class="src src-yaml">DEVICE=eth0
BOOTPROTO=none
NM_CONTROLLED=none
TYPE=Ethernet
BRIDGE=br0
IPV6INIT=no
</pre>
</div></li>
</ol></dd>
<dt>使用 <code>bridge-utils</code> 来配置</dt><dd><div class="org-src-container">

<pre class="src src-yaml">brctl show  <span style="color: #75715E;"># </span><span style="color: #75715E;">&#26174;&#31034;&#25152;&#26377;&#26725;&#35774;&#22791;</span>
brctl addbr br0  <span style="color: #75715E;"># </span><span style="color: #75715E;">&#28155;&#21152;&#19968;&#20010;&#26725;&#35774;&#22791;</span>

ip addr del IP dev eth0  <span style="color: #75715E;"># </span><span style="color: #75715E;">&#21024;&#38500;eth0&#30340;&#22320;&#22336;</span>

brctl addif br0 eth0  <span style="color: #75715E;"># </span><span style="color: #75715E;">&#36830;&#25509;&#26725;&#35774;&#22791;&#21644;&#34987;&#20316;&#20026;&#20132;&#25442;&#26426;&#30340;&#32593;&#21345;</span>
ip link set eth0 promisc on  <span style="color: #75715E;"># </span><span style="color: #75715E;">&#24320;&#21551;&#32593;&#21345;&#30340;&#28151;&#26434;&#27169;&#24335;&#65292;&#20197;&#25509;&#21463;&#25152;&#26377;&#21457;&#26469;&#30340;&#21253;</span>

ip addr add IP/MASK dev br0  <span style="color: #75715E;"># </span><span style="color: #75715E;">&#23558;eth0&#21407;&#26469;&#30340;&#22320;&#22336;&#37197;&#32622;&#21040;&#26725;&#35774;&#22791;&#19978;</span>
route add default gw GW
</pre>
</div></dd>
</dl>
<pre class="example">
可以使用 nmgui 对网络进行管理
</pre>
</div>
</div>
</div>
</div>
<div id="outline-container-orgheadline32" class="outline-2">
<h2 id="orgheadline32"><span class="section-number-2">2</span> KVM</h2>
<div class="outline-text-2" id="text-2">
<pre class="example">
KVM: Kernel-based Virtual Machine，依赖于HVM (VT-x, ADM-V)
</pre>
</div>
<div id="outline-container-orgheadline13" class="outline-3">
<h3 id="orgheadline13">系统的运行模式</h3>
<div class="outline-text-3" id="text-orgheadline13">
<ul class="org-ul">
<li><code>来宾-内核模式</code>: GuestOS的内核模式，用于执行I/O类操作，或其它的特殊指令的操作，之后交给VMM负责管理运行</li>
<li><code>来宾-用户模式</code>: GuestOS的内核模式，用于执行非I/O类操作，若架构一样直接在CPU上运行，否则需要交给VMM负责运行</li>
<li><code>用户模式</code>: 宿主机的用户空间，代表GuestOS请求I/O类操作</li>
<li><code>kvm hypervisor</code>: 宿主机自己的内核空间</li>
</ul>
</div>
</div>
<div id="outline-container-orgheadline14" class="outline-3">
<h3 id="orgheadline14">KVM组件</h3>
<div class="outline-text-3" id="text-orgheadline14">
<ul class="org-ul">
<li><code>/dev/kvm</code>: 工作于 <code>hypervisor</code> 的字符设备，在用户空间可通过 <code>ioctl()</code> 系统调用来完成VM的管理功能，如创建VM、为VM分配内存、读写VCPU的寄存器、向VCPU注入中断、运行VCPU等等</li>
<li><code>QEMU进程</code>: 工作于用户空间，主要用于实现模拟PC机的I/O设备，其功能如下
<ul class="org-ul">
<li>处理器模拟器(不同架构)</li>
<li>仿真I/O设备</li>
<li>关联模拟的设备至真实设备</li>
<li>调试器</li>
<li>与模拟器交互的用户接口</li>
</ul></li>
</ul>
</div>
</div>

<div id="outline-container-orgheadline15" class="outline-3">
<h3 id="orgheadline15">KVM特性</h3>
<div class="outline-text-3" id="text-orgheadline15">
<ul class="org-ul">
<li>内存管理
<ul class="org-ul">
<li>将分配给VM的内存交换至SWAP</li>
<li>支持使用Huge Page</li>
<li>支持使用Intel EPT或AMD RVI技术完成内存地址映射</li>
<li>支持KSM(Kernel Same-page Merging): 合并相同的共享库文件内存</li>
</ul></li>
<li>存储
<ul class="org-ul">
<li>本地存储</li>
<li>网络附加存储</li>
<li>存储区域网络</li>
<li>分布式存储，如GlustFS</li>
</ul></li>
<li>实时迁移: 在使用共享存储的基础上，通过内存复制的方法迁移正在运行的虚拟机</li>
<li>支持运行Linux, Windows, OpenBSD, FreeBSD, OpenSolaris</li>
<li>设备驱动
<ul class="org-ul">
<li>I/O设备的完全虚拟化: 模拟硬件</li>
<li>I/O设备的半虚拟化: 在GuestOS中安装驱动(virtio)</li>
</ul></li>
</ul>
</div>
</div>
