blog/2016-08-26-虚拟化与kvm.org
** KVM局限性
- CPU的过载能力有限
- 虚拟机时间难以精确，依赖于时间同步机制
- MAC地址在VM量特别大时，存在冲突的可能性
** KVM工具
- QEMU ::
  - =/usr/libexec/qemu-kvm=
  - =qemu-img=
- libvirt :: 通用虚拟机管理，支持远程管理
  - GUI: =virt-manager=, =virt-viewer=
  - CLI: =virt-install= (安装工具), =virsh= (管理工具)
- 工具组 ::
  - Virtualization: =qemu-kvm=
  - Virtualization Client: =python-virtinst=, =virt-manager=, =virt-viewer=
  - Virtualization Platform: =libvirt=, =libvirt-client=
- cirros project :: 为cloud环境测试vm提供的微缩版Linux

** KVM的安装
1. 确保CPU支持HVM
   #+BEGIN_SRC bash
   grep -E "(vmx|svm)" /proc/cpuinfo
   #+END_SRC
2. 装载模块
   #+BEGIN_SRC bash
   modprobe kvm
   #+END_SRC
3. 验证 =/dev/kvm= 是否存在即可

** 半虚拟化virtio
=virtio= 仅实现驱动的前端部分(虚拟机部分)，主机的驱动是由 =QEMU= 实现
- virtio-balloon ::
  - ballooning: 让VM中运行的GuestOS自动根据系统占用来调整其所占host的内存大小
  - 手动查看GuestOS的内存用量
    #+BEGIN_SRC bash
    info balloon
    balloon N
    #+END_SRC
- virtio-net ::
  #+BEGIN_SRC yaml
  # 将Host中的GSO, TSO关掉可能会提升性能
  ethtool -K $IF gso off
  ethtool -K $IF tso off
  ethtool -k $IF
  #+END_SRC
- virtio-blk ::
- virtio-pci ::
- virtio-console ::
- kvm-clock :: 半虚拟化时钟，提高虚拟机的时间精度
  #+BEGIN_SRC yaml
  # 修改/boot/config-2.6.32-504.el6.x86_64
  CONFIG_PARAVIRT_GUEST=y
  CONFIG_PARAVIRT=y
  CONFIG_PARAVIRT_CLOCK=y
  #+END_SRC
  
** QEMU
*** qemu-kvm
**** 命令格式
#+BEGIN_SRC yaml
qemu-kvm [OPTIONS] [disk_image]  # 虚拟机管理工具
#+END_SRC
**** 选项的分类
- 标准选项
- 显示选项
- 块设备选项
- 网络选项
- i386平台专用选项
- 字符设备选项
- 蓝牙设备选项
- Linux启动专用选项
- 调试/专家模式选项

**** 启动第一个虚拟机
#+BEGIN_SRC bash
qemu-kvm -m 128 -smp 2 -name test -hda /images/kvm/cirros-0.3.4-i386.disk.img  # 基于模拟载入磁盘设备
qemu-kvm -m 128 -name test -smp 2 -drive file=/images/kvm/cirros-0.3.4-i386-disk.img,if=virtio,media=disk,cache=writeback,format=qcow2  # 使用半虚拟化的方式载入磁盘设备
# 默认会监听一个显示器端口，可以用远程RFB协议软件进行连接，例如tigervnc
#+END_SRC

**** 标准选项
qemu-kvm的标准选项主要涉及指定主机类型、CPU模式、NUMA等
- =-name name=: 设定虚拟机名称
- =-M machine=: 指定要模拟的主机类型，使用 =qemu-kvm -M ?= 获取所支持的所有类型
- =-m megs=: 设定虚拟机的RAM大小
- =-cpu host=: 设定CPU模型，可以使用 =qemu-kvm -cpu ?= 获取所支持的所有模型
- =-smp N[,cores=N][,threads=N][,sockets=N][,maxcpus=N]=: 设定模拟的SMP架构中CPU的个数(最大255)、每个CPU的核心数和线程数及CPU的插槽数目、maxcpus用于指定热插入的CPU个数上限
- =-numa opts=: 指定模拟多节点的numa设备(多CPU下每个CPU自己绑定的内存)
- =-daemonize=: 让虚拟机工作在后台
- =-balloon virtio=: 支持内存动态扩展和缩小
**** 块设备选项
qemu-kvm的块设备选项主要涉及指定软驱设备、光驱设备及硬件设备等
- =-hda|hdb|hdc|hdd file=: 指定file为硬盘镜像
- =-cdrom file=: 指定file为CD-ROM镜像，不能与 =-hdc= 同时使用
- =-drive option,option=: 定义一个硬盘设备
  - =file=/path/to/somefile=: 硬件映像文件路径
  - =if==: 指定硬盘设备所连接的控制器类型，如ide、scsi、sd，尽量使用半虚拟化 =virtio=
  - =index==: 设定同一种控制器类型中不同设备的索引号，即标识号
  - =media==: 定义介质类型为硬盘( =disk= )还是光盘( =cdrom= )
  - =snapshot={on|off}=: 指定当前硬盘设备是否支持快照功能
  - =cache==: 定义如何使用物理机缓存来访问块数据，其可用值有 =none=, =writeback= (延迟写回), =unsafe=, =writethrough= (立即写回)
  - =format==: 指定映像文件的格式，参考qemu-img命令
- =-boot [order=dc][,once=d][,menu=on|off]=: 定义启动设备的引导次序，每种设备使用一个字符表示，once只在创建虚拟机时使用，可配置使用pxe安装系统
  : 不同的架构所支持的设备及其表示字符不尽相同，在x86 PC架构上，a、b表示软驱、c表示第一块硬盘，d表示第一个光驱设备，n-p表示网络适配器；默认为硬盘设备
**** 字符设备选项
- =usbdevice tablet=: 解决鼠标内外不同步的情况
**** 显示选项
显示选项用于定义虚拟机启动后的显示接口相关类型及属性等
- =-nographic=: 用于禁止图形接口，默认情况下，qemu使用VNC来显示VGA输出
  : 快捷键: 
  :   Ctrl-a, c: 在console和monitor之间切换
  :   Ctrl-a, h: 显示帮助信息
  :   Ctrl+Alt+1,2: 切换窗口
- =-sdl=: 启用SDL
- =-vnc display[,OPTIONS]=: 使用VNC协议监听在display上
  - =display=:
    - =host=:N : 监听在host上的5900+N的端口上
    - =unix=:/path/to/socket_file
    - =none=: 不显示
  - =options=:
    - =password=: 连接时需要验证密码；设定密码通过monitor接口使用 =change= 命令
    - =reverse=: "反向"连接至某处于监听状态的vncview上
- =-monitor stdin=: 表示在标准输入输出上显示monitor管理界面
- =-vgs type=: 指定显卡类型，常见类型有cirrus、std、vmware、qxl、none
