_posts/2016-08-26-虚拟化与kvm.html
<div id="outline-container-orgheadline16" class="outline-3">
<h3 id="orgheadline16">KVM局限性</h3>
<div class="outline-text-3" id="text-orgheadline16">
<ul class="org-ul">
<li>CPU的过载能力有限</li>
<li>虚拟机时间难以精确，依赖于时间同步机制</li>
<li>MAC地址在VM量特别大时，存在冲突的可能性</li>
</ul>
</div>
</div>
<div id="outline-container-orgheadline17" class="outline-3">
<h3 id="orgheadline17">KVM工具</h3>
<div class="outline-text-3" id="text-orgheadline17">
<dl class="org-dl">
<dt>QEMU</dt><dd><ul class="org-ul">
<li><code>/usr/libexec/qemu-kvm</code></li>
<li><code>qemu-img</code></li>
</ul></dd>
<dt>libvirt</dt><dd>通用虚拟机管理，支持远程管理
<ul class="org-ul">
<li>GUI: <code>virt-manager</code>, <code>virt-viewer</code></li>
<li>CLI: <code>virt-install</code> (安装工具), <code>virsh</code> (管理工具)</li>
</ul></dd>
<dt>工具组</dt><dd><ul class="org-ul">
<li>Virtualization: <code>qemu-kvm</code></li>
<li>Virtualization Client: <code>python-virtinst</code>, <code>virt-manager</code>, <code>virt-viewer</code></li>
<li>Virtualization Platform: <code>libvirt</code>, <code>libvirt-client</code></li>
</ul></dd>
<dt>cirros project</dt><dd>为cloud环境测试vm提供的微缩版Linux</dd>
</dl>
</div>
</div>

<div id="outline-container-orgheadline18" class="outline-3">
<h3 id="orgheadline18">KVM的安装</h3>
<div class="outline-text-3" id="text-orgheadline18">
<ol class="org-ol">
<li><p>
确保CPU支持HVM
</p>
<div class="org-src-container">

<pre class="src src-bash">grep -E <span style="color: #E6DB74;">"(vmx|svm)"</span> /proc/cpuinfo
</pre>
</div></li>
<li><p>
装载模块
</p>
<div class="org-src-container">

<pre class="src src-bash">modprobe kvm
</pre>
</div></li>
<li>验证 <code>/dev/kvm</code> 是否存在即可</li>
</ol>
</div>
</div>

<div id="outline-container-orgheadline19" class="outline-3">
<h3 id="orgheadline19">半虚拟化virtio</h3>
<div class="outline-text-3" id="text-orgheadline19">
<p>
<code>virtio</code> 仅实现驱动的前端部分(虚拟机部分)，主机的驱动是由 <code>QEMU</code> 实现
</p>
<dl class="org-dl">
<dt>virtio-balloon</dt><dd><ul class="org-ul">
<li>ballooning: 让VM中运行的GuestOS自动根据系统占用来调整其所占host的内存大小</li>
<li><p>
手动查看GuestOS的内存用量
</p>
<div class="org-src-container">

<pre class="src src-bash">info balloon
balloon N
</pre>
</div></li>
</ul></dd>
<dt>virtio-net</dt><dd><div class="org-src-container">

<pre class="src src-yaml"><span style="color: #75715E;"># </span><span style="color: #75715E;">&#23558;Host&#20013;&#30340;GSO, TSO&#20851;&#25481;&#21487;&#33021;&#20250;&#25552;&#21319;&#24615;&#33021;</span>
ethtool -K $IF gso off
ethtool -K $IF tso off
ethtool -k $IF
</pre>
</div></dd>
<dt>virtio-blk</dt><dd></dd>

<dt>virtio-pci</dt><dd></dd>

<dt>virtio-console</dt><dd></dd>

<dt>kvm-clock</dt><dd><p>
半虚拟化时钟，提高虚拟机的时间精度
</p>
<div class="org-src-container">

<pre class="src src-yaml"><span style="color: #75715E;"># </span><span style="color: #75715E;">&#20462;&#25913;/boot/config-2.6.32-504.el6.x86_64</span>
CONFIG_PARAVIRT_GUEST=y
CONFIG_PARAVIRT=y
CONFIG_PARAVIRT_CLOCK=y
</pre>
</div></dd>
</dl>
</div>
</div>

<div id="outline-container-orgheadline30" class="outline-3">
<h3 id="orgheadline30">QEMU</h3>
<div class="outline-text-3" id="text-orgheadline30">
</div><div id="outline-container-orgheadline28" class="outline-4">
<h4 id="orgheadline28">qemu-kvm</h4>
<div class="outline-text-4" id="text-orgheadline28">
</div><ul class="org-ul"><li><a id="orgheadline20"></a>命令格式<br  /><div class="outline-text-5" id="text-orgheadline20">
<div class="org-src-container">

<pre class="src src-yaml">qemu-kvm [OPTIONS] [disk_image]  <span style="color: #75715E;"># </span><span style="color: #75715E;">&#34394;&#25311;&#26426;&#31649;&#29702;&#24037;&#20855;</span>
</pre>
</div>
</div></li>
<li><a id="orgheadline21"></a>选项的分类<br  /><div class="outline-text-5" id="text-orgheadline21">
<ul class="org-ul">
<li>标准选项</li>
<li>显示选项</li>
<li>块设备选项</li>
<li>网络选项</li>
<li>i386平台专用选项</li>
<li>字符设备选项</li>
<li>蓝牙设备选项</li>
<li>Linux启动专用选项</li>
<li>调试/专家模式选项</li>
</ul>
</div></li>

<li><a id="orgheadline22"></a>启动第一个虚拟机<br  /><div class="outline-text-5" id="text-orgheadline22">
<div class="org-src-container">

<pre class="src src-bash">qemu-kvm -m <span style="color: #AE81FF;">128</span> -smp <span style="color: #AE81FF;">2</span> -name test -hda /images/kvm/cirros-0.3.4-i386.disk.img  <span style="color: #75715E;"># </span><span style="color: #75715E;">&#22522;&#20110;&#27169;&#25311;&#36733;&#20837;&#30913;&#30424;&#35774;&#22791;</span>
qemu-kvm -m <span style="color: #AE81FF;">128</span> -name test -smp <span style="color: #AE81FF;">2</span> -drive <span style="color: #FD971F;">file</span>=/images/kvm/cirros-0.3.4-i386-disk.img,<span style="color: #FD971F;">if</span>=virtio,<span style="color: #FD971F;">media</span>=disk,<span style="color: #FD971F;">cache</span>=writeback,<span style="color: #FD971F;">format</span>=qcow2  <span style="color: #75715E;"># </span><span style="color: #75715E;">&#20351;&#29992;&#21322;&#34394;&#25311;&#21270;&#30340;&#26041;&#24335;&#36733;&#20837;&#30913;&#30424;&#35774;&#22791;</span>
<span style="color: #75715E;"># </span><span style="color: #75715E;">&#40664;&#35748;&#20250;&#30417;&#21548;&#19968;&#20010;&#26174;&#31034;&#22120;&#31471;&#21475;&#65292;&#21487;&#20197;&#29992;&#36828;&#31243;RFB&#21327;&#35758;&#36719;&#20214;&#36827;&#34892;&#36830;&#25509;&#65292;&#20363;&#22914;tigervnc</span>
</pre>
</div>
</div></li>

<li><a id="orgheadline23"></a>标准选项<br  /><div class="outline-text-5" id="text-orgheadline23">
<p>
qemu-kvm的标准选项主要涉及指定主机类型、CPU模式、NUMA等
</p>
<ul class="org-ul">
<li><code>-name name</code>: 设定虚拟机名称</li>
<li><code>-M machine</code>: 指定要模拟的主机类型，使用 <code>qemu-kvm -M ?</code> 获取所支持的所有类型</li>
<li><code>-m megs</code>: 设定虚拟机的RAM大小</li>
<li><code>-cpu host</code>: 设定CPU模型，可以使用 <code>qemu-kvm -cpu ?</code> 获取所支持的所有模型</li>
<li><code>-smp N[,cores=N][,threads=N][,sockets=N][,maxcpus=N]</code>: 设定模拟的SMP架构中CPU的个数(最大255)、每个CPU的核心数和线程数及CPU的插槽数目、maxcpus用于指定热插入的CPU个数上限</li>
<li><code>-numa opts</code>: 指定模拟多节点的numa设备(多CPU下每个CPU自己绑定的内存)</li>
<li><code>-daemonize</code>: 让虚拟机工作在后台</li>
<li><code>-balloon virtio</code>: 支持内存动态扩展和缩小</li>
</ul>
</div></li>
<li><a id="orgheadline24"></a>块设备选项<br  /><div class="outline-text-5" id="text-orgheadline24">
<p>
qemu-kvm的块设备选项主要涉及指定软驱设备、光驱设备及硬件设备等
</p>
<ul class="org-ul">
<li><code>-hda|hdb|hdc|hdd file</code>: 指定file为硬盘镜像</li>
<li><code>-cdrom file</code>: 指定file为CD-ROM镜像，不能与 <code>-hdc</code> 同时使用</li>
<li><code>-drive option,option</code>: 定义一个硬盘设备
<ul class="org-ul">
<li><code>file=/path/to/somefile</code>: 硬件映像文件路径</li>
<li><code>if=</code>: 指定硬盘设备所连接的控制器类型，如ide、scsi、sd，尽量使用半虚拟化 <code>virtio</code></li>
<li><code>index=</code>: 设定同一种控制器类型中不同设备的索引号，即标识号</li>
<li><code>media=</code>: 定义介质类型为硬盘( <code>disk</code> )还是光盘( <code>cdrom</code> )</li>
<li><code>snapshot={on|off}</code>: 指定当前硬盘设备是否支持快照功能</li>
<li><code>cache=</code>: 定义如何使用物理机缓存来访问块数据，其可用值有 <code>none</code>, <code>writeback</code> (延迟写回), <code>unsafe</code>, <code>writethrough</code> (立即写回)</li>
<li><code>format=</code>: 指定映像文件的格式，参考qemu-img命令</li>
</ul></li>
<li><p>
<code>-boot [order=dc][,once=d][,menu=on|off]</code>: 定义启动设备的引导次序，每种设备使用一个字符表示，once只在创建虚拟机时使用，可配置使用pxe安装系统
</p>
<pre class="example">
不同的架构所支持的设备及其表示字符不尽相同，在x86 PC架构上，a、b表示软驱、c表示第一块硬盘，d表示第一个光驱设备，n-p表示网络适配器；默认为硬盘设备
</pre></li>
</ul>
</div></li>
<li><a id="orgheadline25"></a>字符设备选项<br  /><div class="outline-text-5" id="text-orgheadline25">
<ul class="org-ul">
<li><code>usbdevice tablet</code>: 解决鼠标内外不同步的情况</li>
</ul>
</div></li>
<li><a id="orgheadline26"></a>显示选项<br  /><div class="outline-text-5" id="text-orgheadline26">
<p>
显示选项用于定义虚拟机启动后的显示接口相关类型及属性等
</p>
<ul class="org-ul">
<li><p>
<code>-nographic</code>: 用于禁止图形接口，默认情况下，qemu使用VNC来显示VGA输出
</p>
<pre class="example">
快捷键: 
  Ctrl-a, c: 在console和monitor之间切换
  Ctrl-a, h: 显示帮助信息
  Ctrl+Alt+1,2: 切换窗口
</pre></li>
<li><code>-sdl</code>: 启用SDL</li>
<li><code>-vnc display[,OPTIONS]</code>: 使用VNC协议监听在display上
<ul class="org-ul">
<li><code>display</code>:
<ul class="org-ul">
<li><code>host</code>:N : 监听在host上的5900+N的端口上</li>
<li><code>unix</code>:/path/to/socket_file</li>
<li><code>none</code>: 不显示</li>
</ul></li>
<li><code>options</code>:
<ul class="org-ul">
<li><code>password</code>: 连接时需要验证密码；设定密码通过monitor接口使用 <code>change</code> 命令</li>
<li><code>reverse</code>: "反向"连接至某处于监听状态的vncview上</li>
</ul></li>
</ul></li>
<li><code>-monitor stdin</code>: 表示在标准输入输出上显示monitor管理界面</li>
<li><code>-vgs type</code>: 指定显卡类型，常见类型有cirrus、std、vmware、qxl、none</li>
</ul>
</div></li>
