blog/2016-08-26-虚拟化与kvm.org
**** 网络选项
网络属性相关选项用于定义网络设备接口类型及其相关的各属性等信息
- =-net nic[,OPTIONS]=: 设置虚拟机上的虚拟网卡(虚拟网卡前端)
  - =vlan=n=: 设置该设备VLAN编号，默认值为0
  - =name=name=: 设置名称，在monitor中显示
  - =macaddr=mac=: 设置设备的MAC，前6位应固定为52:54:00
  - =model=type=: 设定网卡的类型，默认为e1000，可开启半虚拟化virtio
  - =addr=addr=: 设定网卡的IP地址
- =-net tap[,OPTIONS]=: 连接宿主机端的TAP网络接口(虚拟网卡后端)
  - =vlan=n=: 设置该设备VLAN编号，默认值为0
  - =name=name=: 设置名称，在monitor中显示
  - =fd=h=: 连接到现在已经打开着的TAP接口的文件描述符，当使用了fd=h的选项后，ifname、script、downscript、helper、vnet_hdr等选项都不可使用
  - =ifname=name=: 设置在宿主机中添加的TAP虚拟设备的名称(如tap1、tap5等等)
  - =script=file=: 设置宿主机在启动客户机时自动执行的网络配置脚本。如果不指定，其默认值为 =/etc/qemu-ifup= 这个脚本；如果不需要执行脚本，则设置为 =script=no=
    #+BEGIN_SRC bash
    # cat /etc/qemu-ifup 
    #!/bin/bash
    #
    bridge=br0
    if [ -n "$1" ]; then
        ip link set $1 up  # $1为虚拟机网卡在主机上的名称，如tap1
        sleep 1
        brctl addif $bridge $1  # 添加网卡到桥设备上
    [ $? -eq 0 ] && exit 0 || exit 1
        else
        echo "Error: no interface specified."
    exit 1
    fi
    #+END_SRC
  - =downscript=dfile=: 设置宿主机在客户机关闭时自动执行的网络配置脚本。如果不设置，其默认值为 =/etc/qemu-ifdown= ；若客户机关闭时宿主机不需要执行脚本，则设置为 =downscript=no=
    #+BEGIN_SRC bash
    # cat /etc/qemu-ifdown 
    #!/bin/bash
    #
    bridge=br0
    if [ -n "$1" ];then
        brctl delif $bridge $1  # 删除桥设备上的该网卡，但默认操作也会删除
        ip link set $1 down
        exit 0
    else
        echo "Error: no interface specified."
        exit 1
    fi
    #+END_SRC
  - =vnet_hdr=on,vhost=on=: 用于提高半虚拟化网卡的后端性能
- =-net user=: 在用户空间中创建网卡，无需管理员权限
*** qemu-img
#+BEGIN_SRC yaml
qemu-img subcommand [options]  # 用于磁盘映像管理
#+END_SRC
- =create=: 创建一个新的磁盘映像文件
  #+BEGIN_SRC bash
  qemu-img create [-f fmt] [-o OPTIONS] filename [size]
  qemu-img create -f qcow2 -o size=120G,preallocation=metadata /VM/images/rhel5.8/hda 
  #+END_SRC
  : fmt: 
  :   raw: 不存储额外数据，不支持高级功能，可节约带宽
  :   qcow2: 提供高级功能，支持快照、压缩和加密
- =check=: 检查磁盘映像文件中的错误
- =convert=: 转换磁盘映像的格式
- =info=: 显示指定磁盘映像的信息
- =snapshot=: 管理磁盘映像的快照
- =commit=: 提交磁盘映像的所有改变
- =rbase=: 基于某磁盘映像创建新的映像文件
- =resize=: 增大或缩减磁盘映像文件的大小
** 虚拟机迁移
- 迁移需要共享存储映像文件
- 在待迁入主机使用
  #+BEGIN_SRC bash
  qemu-kvm -vnc :N -incoming tcp:0:7777  # 打开接收端口
  vncviewer :590N
  #+END_SRC
- 在源主机monitor中使用
  #+BEGIN_SRC bash
  migrate tcp:DEST_IP:DEST:PORT
  #+END_SRC
* libvirt工具
** libvirt
- 支持的虚拟化技术: KVM、XEN、VMWARE、LXC、QEMU
- libvirt中的术语
  - =node=: 指物理节点
  - =hypervisor= 
  - =domain=: vm instances
** libvirt的安装和配置
- 安装 ::
  #+BEGIN_SRC yaml
  yum install libvirt libvirt-client virt-install virt-manager
  #+END_SRC
- libvirt和libvirtd的配置文件 ::
  - libvirt配置文件: =/etc/libvirt/libvirt.conf=
  - 守护进程配置文件: =/etc/libvirt/libvirtd.conf=
  - 网络配置文件: =/etc/libvirt/qemu/networks/default.xml=
** 使用桥接模式
#+BEGIN_SRC yaml
virsh iface-bridge eth0 br0 --no-stp  # 使用桥接模式
#+END_SRC
** virt-install
*** 一般选项
指定虚拟机的名称、内存大小、VCPU个数及特性等
- =--name=NAME=: 虚拟机名称，需全局唯一
- =--ram=MEMORY=: 虚拟机内在大小，单位为MB
- =--vcpus=VCPUS[,maxvcpus=MAX][,sockets=#][,cores=#][,threads=#]=: VCPU个数及相关配置
- =--cpu=CPU=: CPU模式及特性
*** 安装方法
指定安装方法、GuestOS类型等
- =--cdrom=CDROM=: 光盘安装介质
- =--location=LOCATION=: 安装源URL，支持FTP、HTTP及NFS等
- =--pxe=: 基于PXE完成安装
- =--os-type=DISTRO_TYPE=: 操作系统类型，如linux、unix或windows等
- =--os-variant=DISTRO_VARIANT=: 某类型操作系统的变体，如rhel5、fedora8等
- =--extra-args=EXTRA=: 根据 =--location= 指定的方式安装GuestOS时，用于传递给内核的额外选项
  : 指定kickstart文件的位置: --extra-args "ks=http://172.16.0.1/class.cfg"
- =--boot cdrom,hd,network=: 指定引导次序
*** 存储配置
指定存储类型、位置及属性等
- =--disk arg=value,...=: 指定存储设备及其属性
  - =device=: 设备类型，如cdrom、disk或floppy等，默认为disk
  - =bus=: 磁盘总线类型，其值可以为ide、scsi、usb、virtio或xen
  - =perms=: 访问权限，如rw、ro或sh（共享的可读写），默认为rw
  - =size=: 新建磁盘映像的大小，单位为GB
  - =cache=: 缓存模型，其值有none、writethrouth及writeback
  - =format=: 磁盘映像格式，如raw、qcow2、vmdk等
  - =sparse=: 磁盘映像使用稀疏格式，即不立即分配指定大小的空间
- =--nodisks=: 不使用本地磁盘，在LiveCD模式中常用
*** 网络配置
指定网络接口的网络类型及接口属性如MAC地址、驱动模式等
- =--network opt1=val1,opt2=val2=: 将虚拟机连入宿主机的网络中
  - =bridge=BRIDGE=: 连接至名为"BRIDEG"的桥设备
  - =network=NAME=: 连接至名为"NAME"的网络
  - =model=: 虚拟机网卡的设备型号，如e1000、rtl8139或virtio等
  - =mac=: MAC地址，省略此选项时将使用随机地址，对于KVM来说，其前三段必须为52:54:00
- =--nonetworks=: 虚拟机不使用网络功能
*** 设备选项
指定文本控制台、声音设备、串行接口、并行接口、显示接口等
- =--serial pty=: 创建伪终端
- =--serial=CHAROPTS=: 附加一个串行设备至当前虚拟机
- =--serial dev,path=HOSTPATH=: 附加主机设备至此虚拟机
- =--video=VIDEO=: 指定显卡设备类型，可用取值为cirrus、vga、qxl或vmvga
*** 虚拟化选项
- =--hvm=: 当物理机同时支持完全虚拟化和半虚拟化时，指定使用完全虚拟化
- =--paravirt=: 指定使用半虚拟化
- =--virt-type=: 使用的hypervisor，如kvm、qemu、xen等
