_posts/2016-08-26-虚拟化与kvm.html
<li><a id="orgheadline27"></a>网络选项<br  /><div class="outline-text-5" id="text-orgheadline27">
<p>
网络属性相关选项用于定义网络设备接口类型及其相关的各属性等信息
</p>
<ul class="org-ul">
<li><code>-net nic[,OPTIONS]</code>: 设置虚拟机上的虚拟网卡(虚拟网卡前端)
<ul class="org-ul">
<li><code>vlan=n</code>: 设置该设备VLAN编号，默认值为0</li>
<li><code>name=name</code>: 设置名称，在monitor中显示</li>
<li><code>macaddr=mac</code>: 设置设备的MAC，前6位应固定为52:54:00</li>
<li><code>model=type</code>: 设定网卡的类型，默认为e1000，可开启半虚拟化virtio</li>
<li><code>addr=addr</code>: 设定网卡的IP地址</li>
</ul></li>
<li><code>-net tap[,OPTIONS]</code>: 连接宿主机端的TAP网络接口(虚拟网卡后端)
<ul class="org-ul">
<li><code>vlan=n</code>: 设置该设备VLAN编号，默认值为0</li>
<li><code>name=name</code>: 设置名称，在monitor中显示</li>
<li><code>fd=h</code>: 连接到现在已经打开着的TAP接口的文件描述符，当使用了fd=h的选项后，ifname、script、downscript、helper、vnet_hdr等选项都不可使用</li>
<li><code>ifname=name</code>: 设置在宿主机中添加的TAP虚拟设备的名称(如tap1、tap5等等)</li>
<li><p>
<code>script=file</code>: 设置宿主机在启动客户机时自动执行的网络配置脚本。如果不指定，其默认值为 <code>/etc/qemu-ifup</code> 这个脚本；如果不需要执行脚本，则设置为 <code>script=no</code>
</p>
<div class="org-src-container">

<pre class="src src-bash"><span style="color: #75715E;"># </span><span style="color: #75715E;">cat /etc/qemu-ifup </span>
<span style="color: #75715E;">#</span><span style="color: #75715E;">!/bin/bash</span>
<span style="color: #75715E;">#</span>
<span style="color: #FD971F;">bridge</span>=br0
<span style="color: #F92672;">if</span> <span style="color: #AE81FF;">[</span> -n <span style="color: #E6DB74;">"$1"</span> <span style="color: #AE81FF;">]</span>; <span style="color: #F92672;">then</span>
    ip link set $<span style="color: #AE81FF;">1</span> up  <span style="color: #75715E;"># </span><span style="color: #75715E;">$1&#20026;&#34394;&#25311;&#26426;&#32593;&#21345;&#22312;&#20027;&#26426;&#19978;&#30340;&#21517;&#31216;&#65292;&#22914;tap1</span>
    sleep <span style="color: #AE81FF;">1</span>
    brctl addif $<span style="color: #FD971F;">bridge</span> $<span style="color: #AE81FF;">1</span>  <span style="color: #75715E;"># </span><span style="color: #75715E;">&#28155;&#21152;&#32593;&#21345;&#21040;&#26725;&#35774;&#22791;&#19978;</span>
<span style="color: #AE81FF;">[</span> $<span style="color: #FD971F;">?</span> -eq <span style="color: #AE81FF;">0</span> <span style="color: #AE81FF;">]</span> &amp;&amp; <span style="color: #F92672;">exit</span> <span style="color: #AE81FF;">0</span> || <span style="color: #F92672;">exit</span> <span style="color: #AE81FF;">1</span>
    <span style="color: #F92672;">else</span>
    <span style="color: #F92672;">echo</span> <span style="color: #E6DB74;">"Error: no interface specified."</span>
<span style="color: #F92672;">exit</span> <span style="color: #AE81FF;">1</span>
<span style="color: #F92672;">fi</span>
</pre>
</div></li>
<li><p>
<code>downscript=dfile</code>: 设置宿主机在客户机关闭时自动执行的网络配置脚本。如果不设置，其默认值为 <code>/etc/qemu-ifdown</code> ；若客户机关闭时宿主机不需要执行脚本，则设置为 <code>downscript=no</code>
</p>
<div class="org-src-container">

<pre class="src src-bash"><span style="color: #75715E;"># </span><span style="color: #75715E;">cat /etc/qemu-ifdown </span>
<span style="color: #75715E;">#</span><span style="color: #75715E;">!/bin/bash</span>
<span style="color: #75715E;">#</span>
<span style="color: #FD971F;">bridge</span>=br0
<span style="color: #F92672;">if</span> <span style="color: #AE81FF;">[</span> -n <span style="color: #E6DB74;">"$1"</span> <span style="color: #AE81FF;">]</span>;<span style="color: #F92672;">then</span>
    brctl delif $<span style="color: #FD971F;">bridge</span> $<span style="color: #AE81FF;">1</span>  <span style="color: #75715E;"># </span><span style="color: #75715E;">&#21024;&#38500;&#26725;&#35774;&#22791;&#19978;&#30340;&#35813;&#32593;&#21345;&#65292;&#20294;&#40664;&#35748;&#25805;&#20316;&#20063;&#20250;&#21024;&#38500;</span>
    ip link set $<span style="color: #AE81FF;">1</span> down
    <span style="color: #F92672;">exit</span> <span style="color: #AE81FF;">0</span>
<span style="color: #F92672;">else</span>
    <span style="color: #F92672;">echo</span> <span style="color: #E6DB74;">"Error: no interface specified."</span>
    <span style="color: #F92672;">exit</span> <span style="color: #AE81FF;">1</span>
<span style="color: #F92672;">fi</span>
</pre>
</div></li>
<li><code>vnet_hdr=on,vhost=on</code>: 用于提高半虚拟化网卡的后端性能</li>
</ul></li>
<li><code>-net user</code>: 在用户空间中创建网卡，无需管理员权限</li>
</ul>
</div></li></ul>
</div>
<div id="outline-container-orgheadline29" class="outline-4">
<h4 id="orgheadline29">qemu-img</h4>
<div class="outline-text-4" id="text-orgheadline29">
<div class="org-src-container">

<pre class="src src-yaml">qemu-img subcommand [options]  <span style="color: #75715E;"># </span><span style="color: #75715E;">&#29992;&#20110;&#30913;&#30424;&#26144;&#20687;&#31649;&#29702;</span>
</pre>
</div>
<ul class="org-ul">
<li><p>
<code>create</code>: 创建一个新的磁盘映像文件
</p>
<div class="org-src-container">

<pre class="src src-bash">qemu-img create <span style="color: #AE81FF;">[</span>-f fmt<span style="color: #AE81FF;">]</span> <span style="color: #AE81FF;">[</span>-o OPTIONS<span style="color: #AE81FF;">]</span> filename <span style="color: #AE81FF;">[</span>size<span style="color: #AE81FF;">]</span>
qemu-img create -f qcow2 -o <span style="color: #FD971F;">size</span>=<span style="color: #AE81FF;">120G,preallocation</span>=metadata /VM/images/rhel5.8/hda
</pre>
</div>
<pre class="example">
fmt: 
  raw: 不存储额外数据，不支持高级功能，可节约带宽
  qcow2: 提供高级功能，支持快照、压缩和加密
</pre></li>
<li><code>check</code>: 检查磁盘映像文件中的错误</li>
<li><code>convert</code>: 转换磁盘映像的格式</li>
<li><code>info</code>: 显示指定磁盘映像的信息</li>
<li><code>snapshot</code>: 管理磁盘映像的快照</li>
<li><code>commit</code>: 提交磁盘映像的所有改变</li>
<li><code>rbase</code>: 基于某磁盘映像创建新的映像文件</li>
<li><code>resize</code>: 增大或缩减磁盘映像文件的大小</li>
</ul>
</div>
</div>
</div>
<div id="outline-container-orgheadline31" class="outline-3">
<h3 id="orgheadline31">虚拟机迁移</h3>
<div class="outline-text-3" id="text-orgheadline31">
<ul class="org-ul">
<li>迁移需要共享存储映像文件</li>
<li><p>
在待迁入主机使用
</p>
<div class="org-src-container">

<pre class="src src-bash">qemu-kvm -vnc :N -incoming tcp:0:7777  <span style="color: #75715E;"># </span><span style="color: #75715E;">&#25171;&#24320;&#25509;&#25910;&#31471;&#21475;</span>
vncviewer :590N
</pre>
</div></li>
<li><p>
在源主机monitor中使用
</p>
<div class="org-src-container">

<pre class="src src-bash">migrate tcp:DEST_IP:DEST:PORT
</pre>
</div></li>
</ul>
</div>
</div>
</div>
<div id="outline-container-orgheadline46" class="outline-2">
<h2 id="orgheadline46"><span class="section-number-2">3</span> libvirt工具</h2>
<div class="outline-text-2" id="text-3">
</div><div id="outline-container-orgheadline33" class="outline-3">
<h3 id="orgheadline33">libvirt</h3>
<div class="outline-text-3" id="text-orgheadline33">
<ul class="org-ul">
<li>支持的虚拟化技术: KVM、XEN、VMWARE、LXC、QEMU</li>
<li>libvirt中的术语
<ul class="org-ul">
<li><code>node</code>: 指物理节点</li>
<li><code>hypervisor</code></li>
<li><code>domain</code>: vm instances</li>
</ul></li>
</ul>
</div>
</div>
<div id="outline-container-orgheadline34" class="outline-3">
<h3 id="orgheadline34">libvirt的安装和配置</h3>
<div class="outline-text-3" id="text-orgheadline34">
<dl class="org-dl">
<dt>安装</dt><dd><div class="org-src-container">

<pre class="src src-yaml">yum install libvirt libvirt-client virt-install virt-manager
</pre>
</div></dd>
<dt>libvirt和libvirtd的配置文件</dt><dd><ul class="org-ul">
<li>libvirt配置文件: <code>/etc/libvirt/libvirt.conf</code></li>
<li>守护进程配置文件: <code>/etc/libvirt/libvirtd.conf</code></li>
<li>网络配置文件: <code>/etc/libvirt/qemu/networks/default.xml</code></li>
</ul></dd>
</dl>
</div>
</div>
<div id="outline-container-orgheadline35" class="outline-3">
<h3 id="orgheadline35">使用桥接模式</h3>
<div class="outline-text-3" id="text-orgheadline35">
<div class="org-src-container">

<pre class="src src-yaml">virsh iface-bridge eth0 br0 --no-stp  <span style="color: #75715E;"># </span><span style="color: #75715E;">&#20351;&#29992;&#26725;&#25509;&#27169;&#24335;</span>
</pre>
</div>
</div>
</div>
<div id="outline-container-orgheadline44" class="outline-3">
<h3 id="orgheadline44">virt-install</h3>
<div class="outline-text-3" id="text-orgheadline44">
</div><div id="outline-container-orgheadline36" class="outline-4">
<h4 id="orgheadline36">一般选项</h4>
<div class="outline-text-4" id="text-orgheadline36">
<p>
指定虚拟机的名称、内存大小、VCPU个数及特性等
</p>
<ul class="org-ul">
<li><code>--name=NAME</code>: 虚拟机名称，需全局唯一</li>
<li><code>--ram=MEMORY</code>: 虚拟机内在大小，单位为MB</li>
<li><code>--vcpus=VCPUS[,maxvcpus=MAX][,sockets=#][,cores=#][,threads=#]</code>: VCPU个数及相关配置</li>
<li><code>--cpu=CPU</code>: CPU模式及特性</li>
</ul>
</div>
</div>
<div id="outline-container-orgheadline37" class="outline-4">
<h4 id="orgheadline37">安装方法</h4>
<div class="outline-text-4" id="text-orgheadline37">
<p>
指定安装方法、GuestOS类型等
</p>
<ul class="org-ul">
<li><code>--cdrom=CDROM</code>: 光盘安装介质</li>
<li><code>--location=LOCATION</code>: 安装源URL，支持FTP、HTTP及NFS等</li>
<li><code>--pxe</code>: 基于PXE完成安装</li>
<li><code>--os-type=DISTRO_TYPE</code>: 操作系统类型，如linux、unix或windows等</li>
<li><code>--os-variant=DISTRO_VARIANT</code>: 某类型操作系统的变体，如rhel5、fedora8等</li>
<li><p>
<code>--extra-args=EXTRA</code>: 根据 <code>--location</code> 指定的方式安装GuestOS时，用于传递给内核的额外选项
</p>
<pre class="example">
指定kickstart文件的位置: --extra-args "ks=http://172.16.0.1/class.cfg"
</pre></li>
<li><code>--boot cdrom,hd,network</code>: 指定引导次序</li>
</ul>
</div>
</div>
<div id="outline-container-orgheadline38" class="outline-4">
<h4 id="orgheadline38">存储配置</h4>
<div class="outline-text-4" id="text-orgheadline38">
<p>
指定存储类型、位置及属性等
</p>
<ul class="org-ul">
<li><code>--disk arg=value,...</code>: 指定存储设备及其属性
<ul class="org-ul">
<li><code>device</code>: 设备类型，如cdrom、disk或floppy等，默认为disk</li>
<li><code>bus</code>: 磁盘总线类型，其值可以为ide、scsi、usb、virtio或xen</li>
<li><code>perms</code>: 访问权限，如rw、ro或sh（共享的可读写），默认为rw</li>
<li><code>size</code>: 新建磁盘映像的大小，单位为GB</li>
<li><code>cache</code>: 缓存模型，其值有none、writethrouth及writeback</li>
<li><code>format</code>: 磁盘映像格式，如raw、qcow2、vmdk等</li>
<li><code>sparse</code>: 磁盘映像使用稀疏格式，即不立即分配指定大小的空间</li>
</ul></li>
<li><code>--nodisks</code>: 不使用本地磁盘，在LiveCD模式中常用</li>
</ul>
</div>
</div>
<div id="outline-container-orgheadline39" class="outline-4">
<h4 id="orgheadline39">网络配置</h4>
<div class="outline-text-4" id="text-orgheadline39">
<p>
指定网络接口的网络类型及接口属性如MAC地址、驱动模式等
</p>
<ul class="org-ul">
<li><code>--network opt1=val1,opt2=val2</code>: 将虚拟机连入宿主机的网络中
<ul class="org-ul">
<li><code>bridge=BRIDGE</code>: 连接至名为"BRIDEG"的桥设备</li>
<li><code>network=NAME</code>: 连接至名为"NAME"的网络</li>
<li><code>model</code>: 虚拟机网卡的设备型号，如e1000、rtl8139或virtio等</li>
<li><code>mac</code>: MAC地址，省略此选项时将使用随机地址，对于KVM来说，其前三段必须为52:54:00</li>
</ul></li>
<li><code>--nonetworks</code>: 虚拟机不使用网络功能</li>
</ul>
</div>
</div>
<div id="outline-container-orgheadline40" class="outline-4">
<h4 id="orgheadline40">设备选项</h4>
<div class="outline-text-4" id="text-orgheadline40">
<p>
指定文本控制台、声音设备、串行接口、并行接口、显示接口等
</p>
<ul class="org-ul">
<li><code>--serial pty</code>: 创建伪终端</li>
<li><code>--serial=CHAROPTS</code>: 附加一个串行设备至当前虚拟机</li>
<li><code>--serial dev,path=HOSTPATH</code>: 附加主机设备至此虚拟机</li>
<li><code>--video=VIDEO</code>: 指定显卡设备类型，可用取值为cirrus、vga、qxl或vmvga</li>
</ul>
</div>
</div>
<div id="outline-container-orgheadline41" class="outline-4">
<h4 id="orgheadline41">虚拟化选项</h4>
<div class="outline-text-4" id="text-orgheadline41">
<ul class="org-ul">
<li><code>--hvm</code>: 当物理机同时支持完全虚拟化和半虚拟化时，指定使用完全虚拟化</li>
<li><code>--paravirt</code>: 指定使用半虚拟化</li>
<li><code>--virt-type</code>: 使用的hypervisor，如kvm、qemu、xen等</li>
</ul>
</div>
</div>
