blog/2016-08-26-虚拟化与kvm.org
*** 其它选项
- =--autostart=: 指定虚拟机是否在物理启动后自动启动
- =--print-xml=: 如果虚拟机不需要安装过程(--import、--boot)，则显示生成的XML而不是创建此虚拟机；默认情况下，此选项仍会创建磁盘映像
- =--force=: 禁止命令进入交互式模式，所有问题自动回答为yes
- =--dry-run=: 执行创建虚拟机的整个过程，但不真正创建虚拟机、改变主机上的设备配置信息及将其创建的需求通知给libvirt
- =--debug=: 显示debug信息
*** virt-install使用示例
尽管 =virt-install= 命令有着类似上述的众多选项，但实际使用中，其必须提供的选项仅包括 =--name=, =--ram=, =--disk= (或者 =--nodisks= )及安装过程相关的选项
#+BEGIN_SRC bash
virt-install -n "centos6" -r 512 --vcpus=2 --pxe --disk path=/images/kvm/centos6.qcow2,size=120,format=qcow2,bus=virtio,sparse=yes --network bridge=br0,model=virtio --force --graphics vnc  # 使用pxe安装系统

virt-install --name cirros --ram 128 --disk /VMs/cirros-*.img --import --network bridge=br0,model=virtio --import --serial=pty --console=pty --nographics # 导入已经存在的磁盘映像文件，并在前台模拟一个终端
#+END_SRC
: 每个虚拟机创建后，其配置信息保存在 /etc/libvirt/qemu 目录中，文件名与虚拟机相同，格式为XML
** virsh常用命令
- 根据xml文件创建虚拟机
  - =create=: 创建并启动
  - =define=: 创建但不启动
- 关闭domain
  - =destroy=: 强制关机
  - =shutdown=: 正常关机
  - =reboot=
- 删除domain
  - =undefine=
- 连接至console
  - =console=
- 列出domain
  - =list=
- 附加或拆除disk
  - =attach-disk=
    #+BEGIN_SRC bash
    virsh attach-disk DOMAIN_ID /PATH/TO/*.qcow2 vda --targetbus virtio
    #+END_SRC
  - =detach-disk=
    #+BEGIN_SRC bash
    virsh detach-disk DOMAIN_ID vda
    #+END_SRC
- 附加或拆除网卡
  - =attach-interface=
    #+BEGIN_SRC bash
    virsh attach-interface 15 bridge br0
    #+END_SRC
  - =detach-interface=
    #+BEGIN_SRC bash
    virsh detach-interface 15 bridge --mac ...
    #+END_SRC
- 挂起与恢复
  - =save=
  - =restore=
- 暂停于 *内存* 中或继续运行
  - =suspend=
  - =resume=
- 查询帮助
  - =help=
