_posts/2016-08-26-虚拟化与kvm.html
<div id="outline-container-orgheadline42" class="outline-4">
<h4 id="orgheadline42">其它选项</h4>
<div class="outline-text-4" id="text-orgheadline42">
<ul class="org-ul">
<li><code>--autostart</code>: 指定虚拟机是否在物理启动后自动启动</li>
<li><code>--print-xml</code>: 如果虚拟机不需要安装过程(&#x2013;import、&#x2013;boot)，则显示生成的XML而不是创建此虚拟机；默认情况下，此选项仍会创建磁盘映像</li>
<li><code>--force</code>: 禁止命令进入交互式模式，所有问题自动回答为yes</li>
<li><code>--dry-run</code>: 执行创建虚拟机的整个过程，但不真正创建虚拟机、改变主机上的设备配置信息及将其创建的需求通知给libvirt</li>
<li><code>--debug</code>: 显示debug信息</li>
</ul>
</div>
</div>
<div id="outline-container-orgheadline43" class="outline-4">
<h4 id="orgheadline43">virt-install使用示例</h4>
<div class="outline-text-4" id="text-orgheadline43">
<p>
尽管 <code>virt-install</code> 命令有着类似上述的众多选项，但实际使用中，其必须提供的选项仅包括 <code>--name</code>, <code>--ram</code>, <code>--disk</code> (或者 <code>--nodisks</code> )及安装过程相关的选项
</p>
<div class="org-src-container">

<pre class="src src-bash">virt-install -n <span style="color: #E6DB74;">"centos6"</span> -r <span style="color: #AE81FF;">512</span> --vcpus=<span style="color: #AE81FF;">2</span> --pxe --disk <span style="color: #FD971F;">path</span>=/images/kvm/centos6.qcow2,<span style="color: #FD971F;">size</span>=<span style="color: #AE81FF;">120,format</span>=qcow2,<span style="color: #FD971F;">bus</span>=virtio,<span style="color: #FD971F;">sparse</span>=yes --network <span style="color: #FD971F;">bridge</span>=br0,<span style="color: #FD971F;">model</span>=virtio --force --graphics vnc  <span style="color: #75715E;"># </span><span style="color: #75715E;">&#20351;&#29992;pxe&#23433;&#35013;&#31995;&#32479;</span>

virt-install --name cirros --ram <span style="color: #AE81FF;">128</span> --disk /VMs/cirros-*.img --import --network <span style="color: #FD971F;">bridge</span>=br0,<span style="color: #FD971F;">model</span>=virtio --import --serial=pty --console=pty --nographics <span style="color: #75715E;"># </span><span style="color: #75715E;">&#23548;&#20837;&#24050;&#32463;&#23384;&#22312;&#30340;&#30913;&#30424;&#26144;&#20687;&#25991;&#20214;&#65292;&#24182;&#22312;&#21069;&#21488;&#27169;&#25311;&#19968;&#20010;&#32456;&#31471;</span>
</pre>
</div>
<pre class="example">
每个虚拟机创建后，其配置信息保存在 /etc/libvirt/qemu 目录中，文件名与虚拟机相同，格式为XML
</pre>
</div>
</div>
</div>
<div id="outline-container-orgheadline45" class="outline-3">
<h3 id="orgheadline45">virsh常用命令</h3>
<div class="outline-text-3" id="text-orgheadline45">
<ul class="org-ul">
<li>根据xml文件创建虚拟机
<ul class="org-ul">
<li><code>create</code>: 创建并启动</li>
<li><code>define</code>: 创建但不启动</li>
</ul></li>
<li>关闭domain
<ul class="org-ul">
<li><code>destroy</code>: 强制关机</li>
<li><code>shutdown</code>: 正常关机</li>
<li><code>reboot</code></li>
</ul></li>
<li>删除domain
<ul class="org-ul">
<li><code>undefine</code></li>
</ul></li>
<li>连接至console
<ul class="org-ul">
<li><code>console</code></li>
</ul></li>
<li>列出domain
<ul class="org-ul">
<li><code>list</code></li>
</ul></li>
<li>附加或拆除disk
<ul class="org-ul">
<li><p>
<code>attach-disk</code>
</p>
<div class="org-src-container">

<pre class="src src-bash">virsh attach-disk DOMAIN_ID /PATH/TO/*.qcow2 vda --targetbus virtio
</pre>
</div></li>
<li><p>
<code>detach-disk</code>
</p>
<div class="org-src-container">

<pre class="src src-bash">virsh detach-disk DOMAIN_ID vda
</pre>
</div></li>
</ul></li>
<li>附加或拆除网卡
<ul class="org-ul">
<li><p>
<code>attach-interface</code>
</p>
<div class="org-src-container">

<pre class="src src-bash">virsh attach-interface <span style="color: #AE81FF;">15</span> bridge br0
</pre>
</div></li>
<li><p>
<code>detach-interface</code>
</p>
<div class="org-src-container">

<pre class="src src-bash">virsh detach-interface <span style="color: #AE81FF;">15</span> bridge --mac ...
</pre>
</div></li>
</ul></li>
<li>挂起与恢复
<ul class="org-ul">
<li><code>save</code></li>
<li><code>restore</code></li>
</ul></li>
<li>暂停于 <b>内存</b> 中或继续运行
<ul class="org-ul">
<li><code>suspend</code></li>
<li><code>resume</code></li>
</ul></li>
<li>查询帮助
<ul class="org-ul">
<li><code>help</code></li>
</ul></li>
</ul>
</div>
</div>
</div>
